{
    "plantName": "Green Beans",
    "description": "Green beans, also known as string beans or snap beans, are tender, elongated pods harvested from bean plants. They belong to the Fabaceae family and are a popular warm-season vegetable grown for their crisp texture and fresh flavor. Green beans come in various shapes and colors, including round, flat, and stringless varieties.",
    "thumbnailImageUrl": "Green Beans_thumbnail",
    "backgroundImageUrl": "Green Beans_background",
    "varieties": "Green beans, also known as snap beans or string beans, come in various types, each with its unique characteristics and culinary uses. Some popular green bean varieties include 'Blue Lake', known for its tender pods and classic flavor; 'Provider', prized for its early and abundant yields; 'Kentucky Wonder', recognized for its long, flavorful pods; and 'Contender', valued for its disease resistance and productivity. These varieties, among others, offer a range of options suited for different culinary preferences and growing conditions.",
     "sowingAndPlanting": {
       "sowingIndoorsDescription": "Green beans are typically direct-sown outdoors, as they do not transplant well. However, you can start them indoors in biodegradable pots filled with seed-starting mix 2-3 weeks before the last frost date. Plant seeds 1 inch deep and keep the soil consistently moist and warm (65-85°F). Transplant seedlings outdoors after the danger of frost has passed and the soil has warmed up.",
       "sowingOutdoorsDescription": "Green beans are best sown directly outdoors once the soil has warmed up and all danger of frost has passed. Choose a sunny location with well-drained soil. Plant seeds 1 inch deep and space them according to the recommended distance for the variety being grown. Keep the soil consistently moist until seedlings emerge.",
       "spaceBetweenPlants": "3\"-6\"",
       "spaceBetweenRows": "18\"-36\"",
       "squareFootPlantingRecommendationsMin": 1,
       "squareFootPlantingRecommendationsMax": 4,
       "lifeCycle": "Annual",
       "seedDepth": "1\"",
       "pHRange": "6.0 - 7.0",
       "germinationSoilTemp": "70-85°F",
       "season": "Green beans should be planted after the danger of frost has passed and the soil has warmed up in spring. They prefer warm temperatures and do not tolerate frost."
     },
     "careAndMaintenance": {
       "optimalSun": "Full Sun",
       "growingSoilTemp": "70-80°F",
       "growingDescription": "Green beans prefer full sun and well-drained soil rich in organic matter. Water regularly, especially during dry periods, to keep the soil consistently moist but not waterlogged. Mulch around plants to conserve moisture, suppress weeds, and maintain even soil temperature.",
       "wateringNeeds": "Regular watering, aiming for 1-2 inches per week.",
       "soilFertility": "Incorporate compost or well-aged manure into the soil before planting to improve fertility and soil structure. Side-dress green beans with a balanced fertilizer once they start flowering.",
       "pruningRequirements": "Green beans do not require pruning.",
       "supportRequirements": "Some green bean varieties may benefit from support, especially pole beans. Install trellises, stakes, or cages for the vines to climb."
     },
     "harvestingAndStorage": {
       "daysToHarvest": "50-70 days from planting",
       "timeToMaturity": "Green beans typically mature and are ready for harvest 50-70 days after planting, depending on the variety and growing conditions.",
       "storageRecommendations": "Harvest green beans when the pods are firm, crisp, and have reached the desired size. Use a sharp knife or scissors to cut the pods from the plant, being careful not to damage the vines. Store harvested green beans in the refrigerator for up to a week. Wash and dry the pods before storing to remove any dirt or debris.",
       "harvestDescription": "Harvest green beans regularly to encourage continuous production. Pick the pods when they are young and tender, usually before the seeds inside have fully developed. Avoid letting the pods become overripe, as they can become tough and fibrous."
     },
     "SpringSowing": {
       "Indoors": [],
       "Transplant": [],
       "Outdoors": [1, 4],
       "LastSowDate": -10
     },
     "FallSowing": {
       "Outdoors": [-11, -9],
       "Transplant": [],
       "DaysToMaturity": 55,
       "FrostTolerance": "Tender"
     },
     "companionPlants": {
         "goodCompanionPlants": [
           {
             "name": "Corn",
             "description": "Corn provides natural support for pole beans to climb, while beans fix nitrogen in the soil, benefiting the nitrogen-demanding corn plants. Interplanting corn with green beans can improve soil fertility and promote healthier growth for both crops."
           },
           {
             "name": "Carrots",
             "description": "Carrots have a shallow root system that complements the deeper roots of green beans. Interplanting carrots with green beans can help maximize space in the garden and reduce competition for soil nutrients."
           },
           {
             "name": "Lettuce",
             "description": "Lettuce has shallow roots and grows well in the shade of taller plants like green beans. Interplanting lettuce with green beans can help conserve soil moisture, suppress weeds, and provide living mulch to cool the soil."
           },
           {
             "name": "Radishes",
             "description": "Radishes are fast-growing and can help break up compacted soil, making it easier for green bean roots to penetrate. Interplanting radishes with green beans can improve soil aeration, drainage, and overall plant health."
           },
           {
             "name": "Potatoes",
             "description": "Potatoes and green beans are compatible companions. Green beans can provide ground cover to help suppress weeds and conserve soil moisture, benefiting potato plants. Additionally, the nitrogen-fixing ability of beans can improve soil fertility for potatoes."
           }
         ],
         "badCompanionPlants": [
           {
             "name": "Onions",
             "description": "Onions and other alliums may inhibit the growth of green beans if planted too closely together. Some studies suggest that alliums release substances that can interfere with bean growth and development."
           },
           {
             "name": "Garlic",
             "description": "Similar to onions, garlic may have an inhibitory effect on green beans if planted too closely together. Planting garlic near green beans may result in reduced growth and yield for bean crops."
           },
           {
             "name": "Sunflower",
             "description": "Sunflowers have dense root systems that may compete with green beans for water and nutrients. Planting them together may result in reduced growth and yield for green bean crops."
           },
           {
             "name": "Brassicas",
             "description": "Brassicas, such as cabbage, broccoli, and kale, may produce allelopathic compounds that inhibit the growth of nearby plants, including green beans. Planting brassicas near green beans may hinder bean growth and development."
           },
           {
             "name": "Beets",
             "description": "Beets and green beans are not ideal companions. While they can grow in the same garden bed, planting them too closely together may result in competition for nutrients and space, leading to reduced yields for both crops."
           }
         ]
       },
     "pests": [
         "Aphids",
         "Leafhopper",
         "Whiteflies",
         "Thrips",
         "Cutworm",
         "Armyworm",
         "Flea Beetle",
         "Leaf Beetle",
         "Mite",
         "Weevil",
         "Asian Lady Beetle",
         "Blister Beetle",
         "Tarnished Plant Bug"
       ],
       "beneficial_insects": [
         "Ladybugs",
         "Lacewings",
         "Hoverflies",
         "Parasitic Wasps",
         "Predatory Mites"
       ],
       "diseases": [
         "Rust",
         "Powdery Mildew",
         "Anthracnose",
         "Bacterial Blight",
         "Fusarium Wilt",
         "Curly Top"
       ],
       "tipsAndTricks": [
         "Plant green beans in well-drained soil with full sun exposure.",
         "Provide support for green bean vines, such as trellises or poles.",
         "Water green beans regularly, especially during dry periods.",
         "Mulch around the base of plants to retain moisture and suppress weeds.",
         "Harvest green beans when they are young and tender, typically before the seeds inside the pods become large and tough.",
         "Rotate crops to prevent the buildup of pests and diseases in the soil.",
         "Monitor plants regularly for signs of pests and diseases, and take appropriate action."
       ],
    "linksToAdditionalResources": [
        {
            "title": "Growing Green Beans: Planting Guide",
            "url": "https://www.almanac.com/plant/beans"
        },
        {
            "title": "How to Harvest and Store Green Beans",
            "url": "https://www.gardeningknowhow.com/edible/vegetables/beans/harvesting-beans.htm"
        }
    ]
}

