
{
    "plantName": "Onions",
    "description": "Onions are versatile bulb vegetables that are widely used in cooking around the world. They belong to the Allium genus, which also includes garlic, shallots, and chives. Onions come in various colors, sizes, and flavors, ranging from sweet to pungent. They can be eaten raw, cooked, or used as flavoring agents in dishes such as soups, stews, and salads.",
    "thumbnailImageUrl": "Onions_thumbnail",
    "backgroundImageUrl": "Onions_background",
    "varieties": "Onions come in various types, including bulb onions, green onions (scallions), and shallots. Bulb onions are further categorized into short-day, long-day, and intermediate-day varieties. Common bulb onion varieties include 'Yellow Sweet Spanish', known for its large size and mild flavor; 'Red Burgundy', prized for its deep red color and sweet taste; and 'White Lisbon', a popular variety of green onions with mild flavor and long, slender stalks.",
      "sowingAndPlanting": {
        "sowingIndoorsDescription": "Onions can be started indoors from seeds or sets (small bulbs). Plant seeds or sets in pots or trays filled with seed-starting mix. Plant seeds 1/4 inch deep and space them 1 inch apart. Keep the soil consistently moist and warm (65-75°F). Transplant seedlings outdoors once they have developed strong roots and the weather has warmed up.",
        "sowingOutdoorsDescription": "Onions can also be directly sown outdoors in well-drained soil once the soil can be worked. Choose a sunny location with fertile soil. Plant seeds or sets 1/4 inch deep and space them 4-6 inches apart in rows spaced 12-18 inches apart. Keep the soil consistently moist until seedlings emerge.",
        "spaceBetweenPlants": "4\"-6\"",
        "spaceBetweenRows": "12\"-18\"",
        "squareFootPlantingRecommendationsMin": 4,
        "squareFootPlantingRecommendationsMax": 9,
        "lifeCycle": "Biennial",
        "seedDepth": "1/4\"",
        "pHRange": "6.0 - 7.0",
        "germinationSoilTemp": "60-75°F",
        "season": "Onions are typically planted in the spring for summer harvest or in the fall for overwintering and spring harvest."
      },
      "careAndMaintenance": {
        "optimalSun": "Full Sun",
        "growingSoilTemp": "55-75°F",
        "growingDescription": "Onions prefer full sun and well-drained, fertile soil. They require regular watering to keep the soil consistently moist but not waterlogged. Mulch around plants to conserve moisture, suppress weeds, and maintain even soil temperature.",
        "wateringNeeds": "Regular watering, aiming for 1-2 inches per week.",
        "soilFertility": "Incorporate compost or well-aged manure into the soil before planting to improve fertility and soil structure. Side-dress onions with nitrogen fertilizer every few weeks during the growing season.",
        "pruningRequirements": "Onions do not require pruning, but you can remove any yellowing or damaged leaves as needed to improve air circulation and bulb development.",
        "supportRequirements": "Onions typically do not require support."
      },
      "harvestingAndStorage": {
        "daysToHarvest": "90-120 days from planting",
        "timeToMaturity": "Onions typically mature and are ready for harvest 90-120 days after planting, depending on the variety and growing conditions.",
        "storageRecommendations": "Harvest onions when the tops have fallen over and started to dry. Carefully dig up the bulbs with a garden fork, being careful not to bruise or damage them. Cure harvested onions by laying them in a warm, dry place with good air circulation for 2-3 weeks. Once cured, trim the tops and roots and store onions in a cool, dry place with good ventilation.",
        "harvestDescription": "Harvest onions when the tops have fallen over and started to dry. Gently lift the bulbs from the soil and allow them to cure before storing. Use a garden fork or shovel to loosen the soil around the bulbs and lift them carefully to avoid bruising."
      },
      "SpringSowing": {
        "Indoors": [],
        "Transplant": [-4, -2],
        "Outdoors": [],
        "LastSowDate": -14
      },
      "FallSowing": {
        "Outdoors": [],
        "Transplant": [],
        "DaysToMaturity": 110,
        "FrostTolerance": "Tolerant"
      },
      "companionPlants": {
          "goodCompanionPlants": [
              {
                  "name": "Carrots",
                  "description": "Carrots make excellent companions for onions. They can be planted near onions to help repel pests like onion flies and provide natural pest control in the garden. Additionally, the two plants complement each other's growth habits and root systems."
              },
              {
                  "name": "Lettuce",
                  "description": "Lettuce is a beneficial companion plant for onions. Planting lettuce near onions helps suppress weeds and provides natural ground cover, which can help retain soil moisture and maintain a healthier garden environment."
              },
              {
                  "name": "Beets",
                  "description": "Beets are compatible with onions and can be planted nearby. They have similar growing requirements and do not compete with onions for space or nutrients. Additionally, beets may help deter pests like onion flies and provide aesthetic diversity to the garden."
              }
          ],
          "badCompanionPlants": [
              {
                  "name": "Beans",
                  "description": "Beans are not recommended to be planted near onions. They may compete for space and nutrients, leading to reduced growth and yield for both plants. Additionally, beans and onions have different soil and watering requirements, making them incompatible companions in the garden."
              },
              {
                  "name": "Peas",
                  "description": "Peas should be avoided as companions for onions. Like beans, peas compete with onions for resources such as water, nutrients, and sunlight. This competition can negatively impact the growth and development of both plants, resulting in reduced yields and overall plant health."
              }
          ]
      },
      "pests": [
      "Thrips",
      "Onion Maggot",
      "Onion Fly",
      "Bulb Mite",
      "Root Maggot",
      "Leafminer",
      "Armyworm",
      "Cutworm",
      "Flea Beetle",
      "Leaf Beetle"
    ],
    "beneficial_insects": [
      "Ladybugs",
      "Lacewings",
      "Hoverflies",
      "Parasitic Wasps",
      "Predatory Mites"
    ],
    "diseases": [
      "Downy Mildew",
      "Powdery Mildew",
      "Rust",
      "Smut",
      "White Rot",
      "Aster Yellows",
      "Spotted Wilt"
    ],
    "tipsAndTricks": [
      "Plant onions in well-drained soil with full sun exposure.",
      "Space onion sets properly to allow for bulb development.",
      "Water onions regularly, keeping the soil consistently moist but not waterlogged.",
      "Mulch around onion rows to retain moisture and suppress weeds.",
      "Harvest onions when the tops have fallen over and started to dry, typically in late summer.",
      "Rotate crops to prevent the buildup of pests and diseases in the soil.",
      "Monitor plants regularly for signs of pests and diseases, and take appropriate action."
    ],
    "linksToAdditionalResources": [
        {
            "title": "Growing Onions: Planting Guide",
            "url": "https://www.almanac.com/plant/onions"
        },
        {
            "title": "How to Harvest and Store Onions",
            "url": "https://www.gardeningknowhow.com/edible/vegetables/onion/storing-onions.htm"
        }
    ]
}
