
{
    "plantName": "Peanut",
    "description": "Peanut, also known as groundnut, is a legume crop grown for its edible seeds. Peanuts are rich in protein, healthy fats, vitamins, and minerals, making them a nutritious addition to the diet. They are commonly consumed roasted, boiled, or used in the production of peanut butter and oil. Peanuts are well-suited to warm climates and sandy soils, and they require a relatively long growing season to reach maturity.",
    "thumbnailImageUrl": "Peanut_thumbnail",
    "backgroundImageUrl": "Peanut_background",
    "varieties": "Peanuts come in several varieties, each with its unique flavor and characteristics. Common peanut varieties include 'Virginia', known for its large pods and delicious flavor; 'Runner', prized for its high yield and uniform pods; and 'Spanish', which offers smaller pods and a bold flavor. These varieties provide a range of options suited for different culinary preferences and growing conditions.",
     "sowingAndPlanting": {
       "sowingIndoorsDescription": "Peanuts are typically grown from seeds directly sown outdoors rather than started indoors. However, you can start seeds indoors in biodegradable pots or trays filled with seed-starting mix if you want to get a head start on the growing season. Plant seeds 1-2 inches deep and keep the soil consistently moist and warm (70-80°F). Transplant seedlings outdoors once the soil has warmed up and all danger of frost has passed.",
       "sowingOutdoorsDescription": "Peanut seeds should be sown directly outdoors once the soil has warmed up and all danger of frost has passed. Choose a sunny location with well-drained soil. Plant seeds 1-2 inches deep and space them 6-8 inches apart in rows spaced 18-24 inches apart. Keep the soil consistently moist until seedlings emerge.",
       "spaceBetweenPlants": "6\"-8\"",
       "spaceBetweenRows": "18\"-24\"",
       "squareFootPlantingRecommendationsMin": 1,
       "squareFootPlantingRecommendationsMax": 4,
       "lifeCycle": "Annual",
       "seedDepth": "1\"-2\"",
       "pHRange": "5.8 - 6.2",
       "germinationSoilTemp": "70-80°F",
       "season": "Peanuts require a long, warm growing season, so they should be planted in the spring after the danger of frost has passed. They need at least 4-5 months of frost-free weather to mature."
     },
     "careAndMaintenance": {
       "optimalSun": "Full Sun",
       "growingSoilTemp": "70-90°F",
       "growingDescription": "Peanuts prefer full sun and well-drained, sandy loam soil with good aeration. They require regular watering to keep the soil consistently moist but not waterlogged. Avoid overhead watering, as peanuts are susceptible to fungal diseases. Mulch around plants to conserve moisture and suppress weeds.",
       "wateringNeeds": "Regular watering, aiming for 1-2 inches per week.",
       "soilFertility": "Incorporate organic matter such as compost or well-aged manure into the soil before planting to improve fertility and soil structure. Avoid high-nitrogen fertilizers, as they can encourage excessive foliage growth at the expense of pod development.",
       "pruningRequirements": "Peanuts do not require pruning, but you can remove any yellowing or diseased foliage as needed to improve air circulation and reduce disease pressure.",
       "supportRequirements": "Peanut plants do not require support."
     },
     "harvestingAndStorage": {
       "daysToHarvest": "120-150 days from planting",
       "timeToMaturity": "Peanuts typically mature and are ready for harvest 120-150 days after planting, depending on the variety and growing conditions.",
       "storageRecommendations": "Harvest peanuts when the plants begin to yellow and the pods mature. Carefully dig up the plants with a garden fork or shovel, being careful not to damage the pods. Shake off excess soil and allow the pods to dry in a warm, well-ventilated area for 1-2 weeks. Once dry, remove the pods from the plants and store them in a cool, dry place.",
       "harvestDescription": "Harvest peanuts when the plants begin to yellow and the pods mature. Carefully lift the plants from the soil and shake off excess soil. Lay the plants in a warm, dry place with good air circulation to dry the pods."
     },
     "SpringSowing": {
       "Indoors": [],
       "Transplant": [],
       "Outdoors": [4, 8],
       "LastSowDate": null
     },
     "FallSowing": {
       "Outdoors": [],
       "Transplant": [],
       "DaysToMaturity": 120,
       "FrostTolerance": "Tender"
     },
     "companionPlants": {
         "goodCompanionPlants": [
           {
             "name": "Corn",
             "description": "Corn is a beneficial companion for peanuts. Peanuts are legumes that fix nitrogen in the soil, which benefits corn by providing it with a natural source of nitrogen fertilizer. In return, corn provides structural support for peanut plants as they grow, reducing the risk of lodging. Additionally, corn shades the soil, helping to conserve moisture and suppress weeds, which can benefit peanut crops."
           },
           {
             "name": "Beans",
             "description": "Beans are good companions for peanuts. Both peanuts and beans are legumes that fix nitrogen in the soil, improving soil fertility and providing mutual benefits to each other. Interplanting beans with peanuts can enhance nitrogen fixation in the soil, leading to healthier peanut crops. Additionally, beans can act as living mulch, shading the soil and suppressing weeds, which can help conserve moisture and improve growing conditions for peanuts."
           },
           {
             "name": "Sunflower",
             "description": "Sunflowers are beneficial companions for peanuts. Sunflowers provide structural support for peanut plants as they grow, reducing the risk of lodging. Additionally, sunflowers attract beneficial insects like pollinators and predatory insects, which can help improve pollination and provide natural pest control in the garden. Interplanting sunflowers with peanuts can create a diverse and balanced ecosystem, promoting healthier peanut crops."
           },
           {
             "name": "Lettuce",
             "description": "Lettuce is a good companion for peanuts. Interplanting lettuce with peanuts can help maximize garden space and reduce weed competition. Lettuce has shallow roots that complement the deeper taproots of peanuts, allowing them to grow together without competing for nutrients. Additionally, lettuce provides some shade to peanut plants during hot weather, preventing excessive heat stress and promoting healthier growth."
           },
           {
             "name": "Radishes",
             "description": "Radishes are beneficial companions for peanuts. Planting radishes near peanuts can help deter pests like aphids and nematodes, which may affect peanut crops. Radishes have a faster growth rate and can be harvested earlier, which helps loosen the soil and break up soil crusts, creating better growing conditions for peanuts. Additionally, radishes act as a trap crop, attracting pests away from peanuts and providing natural pest control."
           }
         ],
         "badCompanionPlants": [
           {
             "name": "Potatoes",
             "description": "Potatoes may not be ideal companions for peanuts. Both crops have different cultural requirements and growth habits. Potatoes are heavy feeders that require ample space and water, which may compete with peanuts. Additionally, planting them together may increase the risk of disease transmission, as both crops are susceptible to certain soil-borne pathogens."
           },
           {
             "name": "Tomatoes",
             "description": "Tomatoes may not be suitable companions for peanuts. Both crops have different cultural requirements and growth habits. Tomatoes are heavy feeders that require ample sunlight and water, which may overshadow or compete with peanuts. Additionally, planting tomatoes near peanuts may increase the risk of disease transmission, as both crops are susceptible to certain soil-borne pathogens."
           },
           {
             "name": "Onions",
             "description": "Onions may not be the best companions for peanuts. While they belong to the same family (Alliaceae) and have similar cultural requirements, planting them together may increase the risk of disease transmission and pest infestation. Onions and peanuts may attract similar pests and diseases, such as thrips and white rot, which can spread easily between the two crops."
           },
           {
             "name": "Turnips",
             "description": "Turnips may not be ideal companions for peanuts. While they belong to the same family (Brassicaceae) and have similar cultural requirements, planting them together may increase the risk of disease transmission and pest infestation. Turnips and peanuts may attract similar pests and diseases, such as aphids and root-knot nematodes, which can spread easily between the two crops."
           },
           {
             "name": "Celery",
             "description": "Celery may not be suitable for planting near peanuts. Both crops have similar cultural requirements and may compete for space and resources in the garden. Additionally, celery may attract pests like aphids and leafhoppers, which can affect peanut crops. It's best to keep them separate in the garden to avoid potential issues."
           }
         ]
       },
     "pests": [
       "Aphids",
       "Leafhopper",
       "Whiteflies",
       "Thrips",
       "Cutworm",
       "Armyworm",
       "Flea Beetle",
       "Leaf Beetle",
       "Mite",
       "Looper"
     ],
     "beneficial_insects": [
       "Ladybugs",
       "Lacewings",
       "Hoverflies",
       "Parasitic Wasps",
       "Predatory Mites"
     ],
     "diseases": [
       "Leaf Spot",
       "Rust",
       "Smut",
       "Wilt",
       "Root Rot"
     ],
     "tipsAndTricks": [
       "Plant peanuts in well-drained soil with full sun exposure.",
       "Ensure that the soil is loose and well-aerated to promote healthy root development.",
       "Water peanuts regularly, keeping the soil consistently moist but not waterlogged.",
       "Mulch around peanut plants to retain moisture and suppress weeds.",
       "Harvest peanuts when the pods have matured and the outer shell turns yellow.",
       "Rotate crops to prevent the buildup of pests and diseases in the soil.",
       "Monitor plants regularly for signs of pests and diseases, and take appropriate action."
     ],
    "linksToAdditionalResources": [
        {
            "title": "Growing Peanuts: Planting Guide",
            "url": "https://www.almanac.com/plant/peanuts"
        },
        {
            "title": "Peanuts: A Nutritious Crop for Home Gardens",
            "url": "https://extension.umn.edu/vegetables/growing-peanuts"
        }
    ]
}
