
{
    "plantName": "Shallot",
    "description": "Shallots are a type of onion known for their mild, sweet flavor and distinctive, elongated shape. They belong to the Allium genus and are closely related to onions and garlic. Shallots are commonly used in cooking to add flavor to a wide variety of dishes, including soups, sauces, and salads. They are easy to grow in the garden and can be harvested and stored for later use.",
    "thumbnailImageUrl": "Shallot_thumbnail",
    "backgroundImageUrl": "Shallot_background",
    "varieties": "Shallots come in various varieties, each with its unique flavor profile and bulb characteristics. Common shallot varieties include 'French Red', known for its reddish-brown skin and mild, sweet flavor; 'Dutch Yellow', prized for its golden-brown skin and robust flavor; and 'Grey Griselle', which offers a greyish-pink skin and pungent taste. These varieties provide options suited for different culinary preferences and growing conditions.",
     "sowingAndPlanting": {
       "sowingIndoorsDescription": "Shallots are typically propagated from bulbs rather than seeds. If you want to get a head start on the growing season, you can start shallot bulbs indoors in biodegradable pots or trays filled with potting mix. Plant bulbs 1 inch deep with the pointed end facing up. Keep the soil consistently moist and warm (60-70°F). Transplant shallot seedlings outdoors once they have developed roots and the weather has warmed up.",
       "sowingOutdoorsDescription": "Shallot bulbs should be planted directly outdoors in the early spring or late fall. Choose a sunny location with well-drained soil. Plant bulbs 1 inch deep and space them 4-6 inches apart in rows spaced 12-18 inches apart. Keep the soil consistently moist until bulbs start to grow.",
       "spaceBetweenPlants": "4\"-6\"",
       "spaceBetweenRows": "12\"-18\"",
       "squareFootPlantingRecommendationsMin": 9,
       "squareFootPlantingRecommendationsMax": 16,
       "lifeCycle": "Perennial (usually grown as an annual)",
       "seedDepth": "1\"",
       "pHRange": "6.0 - 7.0",
       "germinationSoilTemp": "60-70°F",
       "season": "Shallots prefer cool weather and should be planted in the early spring or late fall. They can tolerate light frosts and may overwinter in mild climates."
     },
     "careAndMaintenance": {
       "optimalSun": "Full Sun to Partial Shade",
       "growingSoilTemp": "60-70°F",
       "growingDescription": "Shallots prefer full sun but can tolerate partial shade, especially in warmer climates. They thrive in well-drained, fertile soil with a pH of 6.0-7.0. Shallots require regular watering to keep the soil consistently moist, especially during dry periods. Mulch around plants to conserve moisture and suppress weeds.",
       "wateringNeeds": "Regular watering, aiming for 1 inch per week.",
       "soilFertility": "Incorporate compost or well-aged manure into the soil before planting to improve fertility and soil structure. Side-dress shallots with a balanced fertilizer once they start growing vigorously.",
       "pruningRequirements": "Shallots do not require pruning.",
       "supportRequirements": "Shallots do not require support."
     },
     "harvestingAndStorage": {
       "daysToHarvest": "90-120 days from planting",
       "timeToMaturity": "Shallots typically mature and are ready for harvest 90-120 days after planting, depending on the variety and growing conditions.",
       "storageRecommendations": "Harvest shallots when the tops start to dry and turn brown. Use a garden fork or trowel to loosen the soil around the bulbs and lift them gently from the ground. Remove any excess soil and trim off the tops. Cure harvested shallots in a warm, dry place with good air circulation for 2-3 weeks to allow them to dry and develop flavor. Store cured shallots in a cool, dark place with good ventilation for several months.",
       "harvestDescription": "Harvest shallots when the tops start to dry and turn brown, usually in late summer or early fall. Gently lift them from the ground, taking care not to damage the bulbs. Rinse the shallots thoroughly to remove any soil before curing or storing them."
     },
     "SpringSowing": {
       "Indoors": [-10, -8],
       "Transplant": [-2, 0],
       "Outdoors": [-4, -2],
       "LastSowDate": -16
     },
     "FallSowing": {
       "Outdoors": [-4, -2],
       "Transplant": [],
       "DaysToMaturity": 110,
       "FrostTolerance": "Tolerant"
     },
     "companionPlants": {
         "goodCompanionPlants": [
           {
             "name": "Carrots",
             "description": "Carrots make excellent companions for scallions. Planting carrots alongside scallions can help deter pests like onion flies and carrot rust flies, as the strong aroma of scallions masks the scent of carrots. Additionally, scallions provide some shade for carrots, helping to prevent soil erosion and retain moisture."
           },
           {
             "name": "Lettuce",
             "description": "Lettuce is a good companion for scallions. Interplanting lettuce and scallions can help maximize space in the garden, as scallions grow upright while lettuce grows close to the ground. The shallow root systems of both plants allow for efficient use of soil nutrients and water."
           },
           {
             "name": "Tomatoes",
             "description": "Tomatoes are beneficial companions for scallions. Planting tomatoes near scallions may help deter pests like aphids and whiteflies, as scallions emit a strong odor that repels these insects. Additionally, the tall growth habit of tomatoes provides some shade for scallions, helping to prevent sunscald."
           },
           {
             "name": "Spinach",
             "description": "Spinach is a beneficial companion for scallions. Planting spinach near scallions provides shade and moisture retention, creating a microclimate that benefits both crops. Additionally, spinach and scallions have complementary nutrient needs, reducing competition for resources in the soil."
           }
         ],
         "badCompanionPlants": [
           {
             "name": "Beans",
             "description": "Beans may not be ideal companions for scallions. Beans are legumes that fix nitrogen in the soil, which may lead to excessive nitrogen levels for scallions. Additionally, beans have different growth habits and nutrient needs, which can result in competition for resources in the garden."
           },
           {
             "name": "Peas",
             "description": "Peas are not recommended as companions for scallions. Peas are nitrogen-fixing plants that enrich the soil with nitrogen, which may lead to overly lush foliage growth in scallions at the expense of bulb development. Additionally, the vining habit of peas may overshadow scallions, reducing their sunlight exposure."
           },
           {
             "name": "Garlic",
             "description": "Garlic may not be an ideal companion for scallions. Both garlic and scallions belong to the allium family and may attract similar pests and diseases. Planting them together may increase the risk of pest infestations and disease outbreaks, leading to reduced yields for both crops."
           },
           {
             "name": "Radishes",
             "description": "Radishes may not be the best companions for scallions. While some gardeners interplant radishes with scallions to deter pests, radishes have shallow root systems that may compete with scallions for nutrients and space. Planting them together may result in reduced yields for both crops."
           }
         ]
       },
     "pests": [
         "Aphids",
         "Thrips",
         "Onion Maggot",
         "Leafminer",
         "Cutworm",
         "Wireworm",
         "Slug",
         "Snail"
       ],
       "beneficial_insects": [
         "Ladybugs",
         "Lacewings",
         "Hoverflies",
         "Parasitic Wasps",
         "Predatory Mites"
       ],
       "diseases": [
         "Downy Mildew",
         "Powdery Mildew",
         "Bacterial Soft Rot",
         "Fusarium Basal Rot",
         "Pink Root",
         "Smudge",
         "Stemphylium Leaf Blight"
       ],
       "tipsAndTricks": [
         "Choose a planting site with well-drained, fertile soil and full sun exposure.",
         "Prepare the soil by adding compost or aged manure to improve fertility and texture.",
         "Plant shallot sets (small bulbs) or seeds directly in the garden in early spring or late summer.",
         "Sow seeds thinly in rows spaced 6-8 inches apart, covering them with a thin layer of soil and keeping them evenly moist until germination.",
         "Thin seedlings to 2-3 inches apart once they reach a height of 2-3 inches.",
         "Water shallots regularly, providing about 1 inch of water per week, and mulch to conserve moisture and suppress weeds.",
         "Fertilize shallots with a balanced fertilizer every 4-6 weeks, following package instructions.",
         "Monitor plants regularly for signs of pests such as aphids and thrips. Use row covers or insecticidal soap as needed.",
         "Watch for symptoms of diseases like downy mildew and bacterial soft rot. Avoid overhead watering and provide good air circulation to reduce humidity around plants.",
         "Harvest shallots when the tops have died back and the bulbs have reached the desired size, typically 90-120 days after planting. Lift them gently with a garden fork, brush off excess soil, and allow them to cure in a warm, dry place for 1-2 weeks before storage."
       ],
    "linksToAdditionalResources": [
        {
            "title": "Growing Shallots: Planting Guide",
            "url": "https://www.almanac.com/plant/shallots"
        },
        {
            "title": "Shallots: A Flavorful Addition to the Garden",
            "url": "https://extension.umn.edu/vegetables/growing-shallots"
        }
    ]
}
