
{
    "plantName": "Calendula",
    "description": "Calendula (Calendula officinalis), also known as pot marigold, is an annual flowering plant prized for its vibrant, daisy-like flowers and medicinal properties. Native to southern Europe, calendula is cultivated for both ornamental and practical purposes. It is commonly grown in gardens, containers, and herbal medicine beds for its beauty, culinary uses, and therapeutic benefits. Calendula flowers are edible and can be used fresh or dried in salads, teas, and as a natural dye.",
    "thumbnailImageUrl": "Calendula_thumbnail",
    "backgroundImageUrl": "Calendula_background",
    "varieties": "Calendula, also known as pot marigold, comes in various varieties, each with its unique flower color and size. Common calendula varieties include 'Orange King', known for its vibrant orange flowers; 'Pacific Beauty Mix', which offers a range of colors from yellow to orange to apricot; and 'Zeolights', prized for its double flowers in shades of yellow and orange. These varieties provide options for different garden aesthetics and culinary or medicinal uses.",
     "sowingAndPlanting": {
       "sowingIndoorsDescription": "Calendula seeds can be started indoors 6-8 weeks before the last frost date in your area. Plant seeds in biodegradable pots or trays filled with seed-starting mix. Sow seeds 1/4 inch deep and keep the soil consistently moist and cool (60-70°F). Provide ample light or use supplemental grow lights. Transplant seedlings outdoors after the danger of frost has passed.",
       "sowingOutdoorsDescription": "Calendula seeds can also be directly sown outdoors in the garden after the danger of frost has passed. Choose a location with full sun to partial shade and well-drained soil. Sow seeds 1/4 inch deep and space them 6-12 inches apart. Keep the soil consistently moist until seedlings emerge.",
       "spaceBetweenPlants": "6\"-12\"",
       "spaceBetweenRows": "12\"-18\"",
       "squareFootPlantingRecommendationsMin": 1,
       "squareFootPlantingRecommendationsMax": 4,
       "lifeCycle": "Annual",
       "seedDepth": "1/4\"",
       "pHRange": "6.0 - 7.0",
       "germinationSoilTemp": "60-70°F",
       "season": "Calendula should be planted in the spring after the danger of frost has passed. It prefers cool weather and can tolerate light frosts, making it suitable for early spring or fall planting in some regions."
     },
     "careAndMaintenance": {
       "optimalSun": "Full Sun to Partial Shade",
       "growingSoilTemp": "60-70°F",
       "growingDescription": "Calendula thrives in full sun to partial shade and well-drained soil with a pH of 6.0-7.0. It requires regular watering to keep the soil consistently moist, especially during dry periods. Mulch around plants to conserve moisture, suppress weeds, and maintain even soil temperature.",
       "wateringNeeds": "Regular watering, aiming for 1 inch per week.",
       "soilFertility": "Calendula is not particularly demanding in terms of soil fertility but benefits from incorporating compost or well-aged manure into the soil before planting to improve soil structure and fertility.",
       "pruningRequirements": "Deadhead spent flowers regularly to encourage continuous blooming. Pinch back leggy growth to promote bushiness.",
       "supportRequirements": "Calendula generally does not require support."
     },
     "harvestingAndStorage": {
       "daysToHarvest": "60-70 days from planting",
       "timeToMaturity": "Calendula typically matures and begins blooming 60-70 days after planting, depending on the variety and growing conditions.",
       "storageRecommendations": "Harvest calendula flowers when they are fully open but before they start to fade. Cut flowers in the morning after the dew has dried but before the sun is too hot. Calendula flowers can be used fresh immediately or dried for later use. To dry calendula, hang the flowers upside down in a well-ventilated area out of direct sunlight. Once completely dry, store the flowers in an airtight container in a cool, dark place.",
       "harvestDescription": "Harvest calendula flowers by cutting the stems just above a set of leaves. Use scissors or pruning shears to avoid damaging the plant. Rinse harvested flowers under cool water to remove any dirt or debris before using them in recipes or drying them for storage."
     },
     "SpringSowing": {
       "Indoors": [-8, -6],
       "Transplant": [-4, -2],
       "Outdoors": [0, 2],
       "LastSowDate": null
     },
     "FallSowing": {
       "Outdoors": [-10, -8],
       "Transplant": [],
       "DaysToMaturity": 60,
       "FrostTolerance": "Tolerant"
     },
     "companionPlants": {
         "goodCompanionPlants": [
           {
             "name": "Tomatoes",
             "description": "Calendula is a beneficial companion for tomatoes. It attracts pollinators like bees and beneficial insects, which can help improve pollination and fruit set in tomato plants. Additionally, calendula may help deter pests like aphids."
           },
           {
             "name": "Lettuce",
             "description": "Calendula is a good companion for lettuce. It attracts pollinators like bees and beneficial insects, which can enhance pollination and improve overall garden biodiversity. Additionally, calendula may help repel pests like aphids and beetles."
           },
           {
             "name": "Cucumbers",
             "description": "Calendula is a suitable companion for cucumbers. It attracts pollinators like bees and beneficial insects, which can enhance cucumber pollination and increase fruit production. Additionally, calendula may help deter pests like cucumber beetles."
           },
           {
             "name": "Beans",
             "description": "Calendula is a good companion for beans. It attracts pollinators like bees and beneficial insects, which can enhance pollination and improve overall garden biodiversity. Additionally, calendula may help repel pests like bean beetles."
           },
           {
             "name": "Carrots",
             "description": "Calendula is a beneficial companion for carrots. It attracts beneficial insects like predatory wasps, which can help control pests like aphids and carrot flies. Additionally, calendula may help improve soil health and add color to the garden."
           }
         ],
         "badCompanionPlants": [
           {
             "name": "Fennel",
             "description": "Fennel may not be an ideal companion for calendula. Some gardeners believe that planting fennel near calendula can negatively affect the growth and flavor of both plants. It's best to separate them in the garden."
           },
           {
             "name": "Parsley",
             "description": "Parsley may not be suitable companion for calendula. Some gardeners believe that planting parsley near calendula can negatively affect the growth and flavor of both plants. It's best to separate them in the garden."
           },
           {
             "name": "Sage",
             "description": "Sage may not be an ideal companion for calendula. Some gardeners believe that planting sage near calendula can negatively affect the growth and flavor of both plants. It's best to separate them in the garden."
           },
           {
             "name": "Rosemary",
             "description": "Rosemary may not be a suitable companion for calendula. Some gardeners believe that planting rosemary near calendula can negatively affect the growth and flavor of both plants. It's best to separate them in the garden."
           },
           {
             "name": "Garlic",
             "description": "Garlic may not be an ideal companion for calendula. Some gardeners believe that planting garlic near calendula can negatively affect the growth and flavor of both plants. It's best to separate them in the garden."
           }
         ]
       },
     "pests": [
       "Aphids",
       "Spider Mite",
       "Whiteflies",
       "Thrips"
     ],
     "beneficial_insects": [
       "Ladybugs",
       "Lacewings",
       "Hoverflies",
       "Parasitic Wasps"
     ],
     "diseases": [
       "Powdery Mildew",
       "Downy Mildew",
       "Leaf Spot",
       "Root Rot"
     ],
     "tipsAndTricks": [
       "Choose a planting site with well-drained soil and full sun to partial shade exposure.",
       "Directly sow calendula seeds outdoors in the spring after the last frost, or start seeds indoors 4-6 weeks before the last frost date.",
       "Water calendula regularly, providing about 1 inch of water per week, and mulch to conserve moisture and suppress weeds.",
       "Fertilize calendula with a balanced fertilizer or compost tea every 4-6 weeks during the growing season, following package instructions.",
       "Deadhead spent flowers to encourage continuous blooming and prevent self-seeding.",
       "Prune calendula plants as needed to remove dead or diseased growth and promote new growth.",
       "Harvest calendula flowers as needed for culinary, medicinal, or decorative use by snipping them from the stem.",
       "Monitor plants regularly for signs of pests such as aphids and spider mites. Use insecticidal soap or neem oil as needed.",
       "Watch for symptoms of diseases like powdery mildew and leaf spot. Provide good air circulation and avoid overhead watering to reduce humidity around plants.",
       "Allow some calendula flowers to go to seed to ensure a continuous supply of plants in subsequent seasons."
     ],
    "linksToAdditionalResources": [
        {
            "title": "Growing Calendula",
            "url": "https://www.rhs.org.uk/advice/grow-your-own/flowers/calendula"
        },
        {
            "title": "Calendula: Planting and Care Guide",
            "url": "https://www.almanac.com/plant/calendula"
        }
    ]
}
