
{
    "plantName": "Sage",
    "description": "Sage is a perennial herb with gray-green, velvety leaves and a strong, earthy flavor. It is widely used in culinary dishes, particularly in Mediterranean cuisine, and is prized for its aromatic qualities and medicinal properties.",
    "thumbnailImageUrl": "Sage_thumbnail",
    "backgroundImageUrl": "Sage_background",
    "varieties": "Sage (Salvia officinalis) comes in various cultivars, each with its unique characteristics and flavors. Some common varieties include 'Common Sage' with its classic aroma and flavor, 'Purple Sage' known for its striking purple foliage, 'Tricolor Sage' with variegated leaves of green, white, and purple, and 'Golden Sage' valued for its golden-yellow foliage.",
     "sowingAndPlanting": {
       "sowingIndoorsDescription": "Sage seeds can be started indoors 6-8 weeks before the last frost date in your area. Plant seeds in pots or trays filled with well-draining potting mix. Sow seeds shallowly, barely covering them with soil, and keep the soil consistently moist. Place the pots in a warm location with indirect sunlight.",
       "sowingOutdoorsDescription": "Sage can also be propagated from stem cuttings or divided from established plants. Take 4-6 inch stem cuttings from healthy sage plants, remove the lower leaves, and dip the cut end in rooting hormone. Plant the cuttings in well-draining soil or a mix of perlite and vermiculite. Keep the soil consistently moist until roots develop.",
       "spaceBetweenPlants": "12\"-24\"",
       "spaceBetweenRows": "24\"-36\"",
       "squareFootPlantingRecommendationsMin": 1,
       "squareFootPlantingRecommendationsMax": 4,
       "lifeCycle": "Perennial",
       "seedDepth": "1/8\"",
       "pHRange": "6.0 - 7.0",
       "germinationSoilTemp": "60-70°F",
       "season": "Sage can be planted outdoors in spring after the danger of frost has passed. It prefers well-drained soil and full sun."
     },
     "careAndMaintenance": {
       "optimalSun": "Full Sun",
       "growingSoilTemp": "60-70°F",
       "growingDescription": "Sage thrives in full sun and well-drained soil with good airflow. It is drought-tolerant once established and does not require frequent watering. Allow the soil to dry out between waterings to prevent root rot. Mulching around plants can help conserve moisture and suppress weeds.",
       "wateringNeeds": "Water newly planted sage regularly until established. Once established, water infrequently, allowing the soil to dry out between waterings.",
       "soilFertility": "Sage is not heavy feeder and can thrive in poor soil. However, incorporating compost or well-aged manure into the soil before planting can provide some nutrients.",
       "pruningRequirements": "Prune sage regularly to maintain its shape and encourage bushy growth. Trim back leggy or woody stems and remove any dead or diseased branches. Avoid heavy pruning, as sage does not regenerate well from old wood.",
       "supportRequirements": "Sage generally does not require support."
     },
     "harvestingAndStorage": {
       "daysToHarvest": "Varies depending on variety and growing conditions.",
       "timeToMaturity": "Sage can be harvested for culinary use once the plant is well-established, usually within the first year after planting.",
       "storageRecommendations": "Harvest sage leaves as needed for culinary use. Use fresh sage immediately for the best flavor. Alternatively, you can dry sage leaves by hanging them upside down in a warm, well-ventilated area until they are dry and brittle. Store dried sage leaves in an airtight container in a cool, dark place.",
       "harvestDescription": "Harvest sage leaves by snipping them from the plant as needed. Avoid harvesting more than one-third of the plant at a time to ensure healthy growth."
     },
     "SpringSowing": {
       "Indoors": [-8, -6],
       "Transplant": [1, 3],
       "Outdoors": [],
       "LastSowDate": -11
     },
     "FallSowing": {
       "Outdoors": [],
       "Transplant": [],
       "DaysToMaturity": 75,
       "FrostTolerance": "Hardy"
     },
     "companionPlants": {
         "goodCompanionPlants": [
           {
             "name": "Rosemary",
             "description": "Sage is a beneficial companion for rosemary as it shares similar cultural requirements and can help deter pests. Planting sage near rosemary can provide a visually appealing and aromatic herb garden while attracting beneficial insects like bees and butterflies. Additionally, both sage and rosemary have antimicrobial properties that can help protect each other from soil-borne diseases."
           },
           {
             "name": "Thyme",
             "description": "Sage pairs well with thyme as both herbs share similar growing conditions and can enhance each other's flavors in culinary dishes. Planting sage and thyme together creates a fragrant and attractive herb garden while providing a variety of culinary herbs for cooking. Additionally, sage and thyme have aromatic oils that can help deter pests and promote overall plant health."
           },
           {
             "name": "Lavender",
             "description": "Sage complements lavender well in the garden as both plants have similar cultural requirements and aromatic properties. Planting sage and lavender together can create a visually stunning and fragrant garden while attracting pollinators like bees and butterflies. Additionally, sage and lavender have natural pest-repelling qualities that can help protect each other from common garden pests."
           },
           {
             "name": "Oregano",
             "description": "Sage and oregano make excellent companions in the garden as they share similar growth habits and cultural requirements. Planting sage and oregano together can create a lush and aromatic herb garden while providing a variety of culinary herbs for cooking. Additionally, sage and oregano have antimicrobial properties that can help protect each other from soil-borne diseases."
           },
           {
             "name": "Chives",
             "description": "Sage pairs well with chives in the garden as both herbs have natural pest-repelling qualities and complement each other in culinary dishes. Planting sage and chives together can provide a natural pest control barrier while adding flavor and aroma to savory dishes. Additionally, chives produce attractive purple flowers that attract beneficial insects like bees and butterflies."
           }
         ],
         "badCompanionPlants": [
           {
             "name": "Basil",
             "description": "Sage should be planted away from basil as they have different cultural requirements and may compete for resources. Basil may outcompete sage for space and nutrients in the soil, leading to reduced growth and vigor for both plants. Additionally, basil is susceptible to certain pests and diseases that may also affect sage."
           },
           {
             "name": "Cilantro",
             "description": "Cilantro is not recommended as a companion for sage as it has different cultural requirements and may attract pests. Planting cilantro near sage can lead to competition for resources and space, resulting in reduced growth and vigor for both plants. Additionally, cilantro is susceptible to certain pests and diseases that may also affect sage."
           },
           {
             "name": "Mint",
             "description": "Sage should be planted away from mint as mint is a vigorous grower and may become invasive. Planting mint near sage can lead to aggressive spreading and overtake the garden bed, crowding out other plants including sage. Additionally, mint has different cultural requirements and may outcompete sage for water and nutrients in the soil."
           },
           {
             "name": "Parsley",
             "description": "Parsley is not recommended as a companion for sage as it has different cultural requirements and may compete for resources. Planting parsley near sage can lead to overcrowding and reduced growth for both plants. Additionally, parsley attracts certain pests and diseases that may also affect sage."
           }
         ]
       },
     "pests": [
         "Aphids",
         "Spider Mite",
         "Whiteflies",
         "Thrips",
         "Leafhopper"
       ],
       "beneficial_insects": [
         "Ladybugs",
         "Lacewings",
         "Hoverflies",
         "Parasitic Wasps"
       ],
       "diseases": [
         "Powdery Mildew",
         "Root Rot",
         "Botrytis Blight"
       ],
       "tipsAndTricks": [
         "Choose a planting location with well-drained soil and full sun exposure for sage.",
         "Plant sage in a raised bed or container with sandy, loamy soil to ensure good drainage.",
         "Water sage plants sparingly, allowing the soil to dry out between waterings.",
         "Avoid overwatering sage, as it is susceptible to root rot in waterlogged conditions.",
         "Prune sage regularly to maintain its shape and promote bushy growth. Pruning also helps improve air circulation around the plant.",
         "Harvest sage leaves as needed for culinary use by cutting them from the plant. Harvest in the morning when the oils are most concentrated.",
         "Monitor plants regularly for signs of pests such as aphids and spider mites. Handpick pests or use insecticidal soap as needed.",
         "Watch for symptoms of diseases like powdery mildew and botrytis blight. Provide good air circulation and avoid overhead watering to reduce humidity around plants.",
         "Sage is drought-tolerant once established and prefers slightly dry conditions. Avoid over-fertilizing, as this can reduce the flavor of the leaves.",
         "Use fresh or dried sage leaves to flavor a variety of dishes, including meats, poultry, stuffing, and soups."
       ],
    "linksToAdditionalResources": [
        {
            "title": "Growing Sage: Planting Guide",
            "url": "https://www.almanac.com/plant/sage"
        },
        {
            "title": "How to Harvest and Store Sage",
            "url": "https://www.gardeningknowhow.com/edible/herbs/sage/harvesting-sage.htm"
        }
    ]
}
