
{
    "plantName": "Stevia",
    "description": "Stevia is a perennial herb with sweet-tasting leaves that are used as a natural sugar substitute. It is prized for its intense sweetness and low-calorie content, making it a popular alternative to refined sugar in beverages, desserts, and other culinary applications.",
    "thumbnailImageUrl": "Stevia_thumbnail",
    "backgroundImageUrl": "Stevia_background",
    "varieties": "St. John's Wort (Hypericum perforatum) is the most common variety used for medicinal purposes. It is a hardy perennial herb with bright yellow flowers and characteristic perforated leaves.",
      "sowingAndPlanting": {
        "sowingIndoorsDescription": "St. John's Wort seeds can be started indoors 6-8 weeks before the last frost date. Plant seeds in pots or trays filled with well-draining potting mix. Sow seeds shallowly, barely covering them with soil, and keep the soil consistently moist. Place the pots in a warm location with indirect sunlight.",
        "sowingOutdoorsDescription": "St. John's Wort can also be directly sown outdoors after the danger of frost has passed. Choose a location with well-draining soil and full sun to partial shade. Scatter seeds over the prepared soil and lightly cover them with a thin layer of soil. Keep the soil consistently moist until seeds germinate.",
        "spaceBetweenPlants": "12\"-18\"",
        "spaceBetweenRows": "24\"-36\"",
        "squareFootPlantingRecommendationsMin": 1,
        "squareFootPlantingRecommendationsMax": 4,
        "lifeCycle": "Perennial",
        "seedDepth": "1/8\"",
        "pHRange": "6.0 - 7.5",
        "germinationSoilTemp": "65-75°F",
        "season": "St. John's Wort can be planted outdoors in spring after the danger of frost has passed."
      },
      "careAndMaintenance": {
        "optimalSun": "Full Sun to Partial Shade",
        "growingSoilTemp": "60-70°F",
        "growingDescription": "St. John's Wort prefers well-draining soil and can tolerate a wide range of soil types. It thrives in full sun to partial shade. Once established, it is drought-tolerant and requires minimal maintenance. Water young plants regularly until established, then water during dry periods.",
        "wateringNeeds": "Water newly planted St. John's Wort regularly until established. Once established, water infrequently, allowing the soil to dry out between waterings.",
        "soilFertility": "St. John's Wort is not a heavy feeder and can thrive in poor soil. However, incorporating compost or well-aged manure into the soil before planting can provide some nutrients.",
        "pruningRequirements": "Prune St. John's Wort plants in early spring to remove dead or damaged branches and encourage new growth. Deadhead spent flowers to promote continuous blooming.",
        "supportRequirements": "St. John's Wort generally does not require support."
      },
      "harvestingAndStorage": {
        "daysToHarvest": "Varies depending on growing conditions.",
        "timeToMaturity": "St. John's Wort can be harvested for medicinal use once the plants are well-established, usually within the first year after planting.",
        "storageRecommendations": "Harvest St. John's Wort flowers and leaves as needed for medicinal use. Dry the harvested parts by hanging them upside down in a warm, well-ventilated area until they are completely dry. Store dried St. John's Wort in an airtight container in a cool, dark place.",
        "harvestDescription": "Harvest St. John's Wort flowers and leaves by snipping them from the plant as needed. Harvest flowers when they are in full bloom, and leaves when they are young and tender."
      },
      "SpringSowing": {
        "Indoors": [],
        "Transplant": [8, 10],
        "Outdoors": [10, 12],
        "LastSowDate": null
      },
      "FallSowing": {
        "Outdoors": [],
        "Transplant": [],
        "DaysToMaturity": 90,
        "FrostTolerance": "Tender"
      },
      "companionPlants": {
          "goodCompanionPlants": [
            {
              "name": "Lemon Balm",
              "description": "Lemon balm is a beneficial companion for stevia as it can help repel pests like mosquitoes and whiteflies due to its strong aroma. Planting lemon balm near stevia can create a fragrant and visually appealing garden while providing natural pest control. Additionally, lemon balm attracts beneficial insects like bees and butterflies, which can help pollinate stevia flowers."
            },
            {
              "name": "Chamomile",
              "description": "Chamomile is a good companion for stevia as it can help improve soil health and attract beneficial insects like hoverflies and parasitic wasps. Planting chamomile near stevia can create a diverse and ecologically balanced garden while providing natural pest control and pollination services. Additionally, chamomile's delicate flowers and mild fragrance can enhance the overall aesthetics of the garden."
            },
            {
              "name": "Lavender",
              "description": "Lavender is a beneficial companion for stevia due to its aromatic foliage, which can help repel pests like aphids, mosquitoes, and moths. Planting lavender near stevia can create a visually appealing and fragrant garden while providing natural pest control. Additionally, lavender attracts beneficial insects like bees and butterflies, which can help pollinate stevia flowers."
            },
            {
              "name": "Thyme",
              "description": "Thyme is a good companion for stevia as it can help repel pests like whiteflies, aphids, and spider mites. Planting thyme near stevia can create a protective barrier against insect damage while providing a flavorful and aromatic addition to the garden. Additionally, thyme's low-growing habit can help suppress weeds and conserve soil moisture."
            },
            {
              "name": "Sage",
              "description": "Sage is a beneficial companion for stevia due to its aromatic foliage and ability to repel pests like cabbage moths and carrot flies. Planting sage near stevia can help protect the plants from insect damage while providing additional flavor and aroma to the garden. Additionally, sage and stevia have complementary medicinal properties and can be used together in herbal remedies."
            }
          ],
          "badCompanionPlants": [
            {
              "name": "Beans",
              "description": "Beans should be avoided as companions for stevia as they have different soil and watering requirements. Planting beans near stevia can lead to competition for resources and space, resulting in reduced growth and vigor for both plants. Additionally, beans may attract pests and diseases that can also affect stevia."
            },
            {
              "name": "Cabbage",
              "description": "Cabbage is not an ideal companion for stevia as it may attract pests like cabbage worms and aphids that can also damage stevia plants. Additionally, cabbage and stevia have different soil and nutrient requirements, which can lead to competition for resources and reduced growth. Planting cabbage near stevia may also increase the risk of disease transmission between the two plants."
            },
            {
              "name": "Fennel",
              "description": "Fennel should be avoided as a companion for stevia as it can inhibit the growth of nearby plants, including stevia. Additionally, fennel may attract pests like aphids and caterpillars, which can also damage stevia plants. Planting fennel near stevia may lead to competition for resources and reduced overall health for both plants."
            }
          ]
        },
      "pests": [
        "Aphids",
        "Spider Mite",
        "Whiteflies",
        "Thrips"
      ],
      "beneficial_insects": [
        "Ladybugs",
        "Lacewings",
        "Hoverflies",
        "Parasitic Wasps"
      ],
      "diseases": [
        "Powdery Mildew",
        "Root Rot"
      ],
      "tipsAndTricks": [
        "Choose a planting location with well-drained soil and partial to full sun exposure for stevia.",
        "Plant stevia in a raised bed or container with sandy, loamy soil to ensure good drainage.",
        "Water stevia plants regularly, keeping the soil evenly moist but not waterlogged.",
        "Avoid overwatering stevia, as it is susceptible to root rot in waterlogged conditions.",
        "Prune stevia regularly to remove dead or diseased branches and encourage bushy growth.",
        "Harvest stevia leaves when the plant is mature by snipping off the leaves with scissors. Leaves are sweetest just before the plant flowers.",
        "Dry harvested stevia leaves by hanging them upside down in a warm, dry location or using a dehydrator. Once dry, crush the leaves into a fine powder for use as a natural sweetener.",
        "Monitor plants regularly for signs of pests such as aphids and spider mites. Handpick pests or use insecticidal soap as needed.",
        "Watch for symptoms of diseases like powdery mildew and root rot. Provide good air circulation and avoid overhead watering to reduce humidity around plants.",
        "Stevia is a tender perennial and may need protection from frost in colder climates. Consider bringing potted plants indoors during the winter months.",
        "Use dried stevia leaves or stevia extract as a natural sweetener in beverages, baked goods, and other recipes. Stevia is much sweeter than sugar, so use sparingly."
      ],
    "linksToAdditionalResources": [
        {
            "title": "Growing Stevia: Planting Guide",
            "url": "https://www.almanac.com/plant/stevia"
        },
        {
            "title": "How to Harvest and Store Stevia",
            "url": "https://www.motherearthnews.com/real-food/harvesting-stevia-zmaz09onzraw"
        }
    ]
}
